package _2013_C;

import java.util.Arrays;
import java.util.Scanner;

/*
 * 问题描述
小明为某机构设计了一个十字型的徽标（并非红十字会啊），如下所示：
..$$$$$$$$$$$$$..
..$...........$..
$$$.$$$$$$$$$.$$$
$...$.......$...$
$.$$$.$$$$$.$$$.$
$.$...$...$...$.$
$.$.$$$.$.$$$.$.$
$.$.$...$...$.$.$
$.$.$.$$$$$.$.$.$
$.$.$...$...$.$.$
$.$.$$$.$.$$$.$.$
$.$...$...$...$.$
$.$$$.$$$$$.$$$.$
$...$.......$...$
$$$.$$$$$$$$$.$$$
..$...........$..
..$$$$$$$$$$$$$..
对方同时也需要在电脑dos窗口中以字符的形式输出该标志，并能任意控制层数。
输入格式
一个正整数 n (n<30) 表示要求打印图形的层数。
输出格式
对应包围层数的该标志。
样例输入1
1
样例输出1
..$$$$$..
..$...$..
$$$.$.$$$
$...$...$
$.$$$$$.$
$...$...$
$$$.$.$$$
..$...$..
..$$$$$..
样例输入2
3
样例输出2
..$$$$$$$$$$$$$..
..$...........$..
$$$.$$$$$$$$$.$$$
$...$.......$...$
$.$$$.$$$$$.$$$.$
$.$...$...$...$.$
$.$.$$$.$.$$$.$.$
$.$.$...$...$.$.$
$.$.$.$$$$$.$.$.$
$.$.$...$...$.$.$
$.$.$$$.$.$$$.$.$
$.$...$...$...$.$
$.$$$.$$$$$.$$$.$
$...$.......$...$
$$$.$$$$$$$$$.$$$
..$...........$..
..$$$$$$$$$$$$$..
 */
public class _08打印十字图 {
	static int N,L=0,R;
	static char[][] arr;
	static void deal(int n) {
//		n=3，总宽17,最大下标16
		int l,r;
		l = (N-n)*2;//最小下标
		r =l + 9+4*(n-1) - 1;//最大下标
		for (int i = l + 2; i <= r-2; i++) {
			arr[l][i] = '$';
			arr[r][i] = '$';
		}
		arr[l+1][l+2] = '$';
		arr[l+1][r-2]= '$';
		arr[r-1][l+2] = '$';
		arr[r-1][r-2] = '$';
		for (int i = l; i < l+3; i++) {
			arr[l+2][i] = '$';arr[r-2][i] = '$';
		}
		for (int i = r; i > r-3; i--) {
			arr[l+2][i] = '$';arr[r-2][i] = '$';
		}
		for (int i = l+3; i <=r-3; i++) {
			arr[i][l] = '$';
			arr[i][r] = '$';
		}
	}
	static void printAll() {
		for (int i = 0; i <=R ; i++) {
			for (int j = 0; j <=R; j++) {
				if (arr[i][j]!='$') arr[i][j] = '.';
				System.out.print(arr[i][j]);
			}
			System.out.println();
		}
	}
	public static void main(String[] args) {
		Scanner in = new Scanner(System.in);
		N = in.nextInt();
		R = 9+4*(N-1)-1;//最大小标
		arr = new char[R+1][R+1];
		for (int i = N; i >= 1; i--) {
			deal(i);
		}
//		deal();
		int c_i = 2*N+2;
		int c_j = 2*N+2;
		arr[c_i][c_j] = '$';
		for (int i = c_i-2; i < c_i+3; i++) {
			arr[i][c_j] = '$';
			arr[c_i][i] = '$';
		}
		printAll();
	}
}
