package _2021_C2;
/*
 * 小蓝对 3 33 的倍数很感兴趣。现在他手头有三个不同的数 a , b , c a, b, ca,b,c，
 * 他想知道，这三个数中是不是有两个数的和是 3 33 的倍数。
例如，当 a = 3 , b = 4 , c = 6 a = 3, b = 4, c = 6a=3,b=4,c=6 时，可以找到 a和 c的和是 3的倍数。
例如，当 a = 3 , b = 4 , c = 7 a = 3, b = 4, c = 7a=3,b=4,c=7 时，没办法找到两个数的和是 3 33 的倍数。
输入格式
输入三行，每行一个整数，分别表示 a , b , c a, b, ca,b,c。
输出格式
如果可以找到两个数的和是 3 33 的倍数，输出 y e s yesyes，否则输出 n o nono。
————————————————
版权声明：本文为CSDN博主「肖有量」的原创文章，遵循CC 4.0 BY-SA版权协议，转载请附上原文出处链接及本声明。
原文链接：https://blog.csdn.net/qq_43449564/article/details/116563852
 */
public class _06_3的倍数 {
	public static void main(String[] args) {
		
	}
}
