package _2020_A;
/*
 * 科学家小蓝来到了一个荒岛，准备对这个荒岛进行探测考察。
小蓝使用了一个超声定位设备来对自己进行定位。为了使用这个设备，小蓝需要在不同的点分别安装一个固定的发射器和一个固定的接收器。
小蓝手中还有一个移动设备。定位设备需要从发射器发射一个信号到移动设备，
移动设备收到后马上转发，最后由接收器接收，根据这些设备之间传递的时间差就能计算出移动设备距离发射器和接收器的两个距离，从而实现定位。
小蓝在两个位置已经安装了发射器和接收器，其中发射器安装在坐标（x A x_Ax A ,y A y_Ay A） ，
接收器安装在坐标(x B x_Bx B ,y B y_By B)。
小蓝的发射器和接收器可能在岛上，也可能不在岛上。
小蓝的定位设备设计有些缺陷，当发射器到移动设备的距离加上移动设备到接收器的距离之和大于L 时，
定位设备工作不正常。当和小于等于L时，定位设备工作正常。为了安全，小蓝只在定位设备工作正常的区域探测考察。
已知荒岛是一个三角形，三个顶点的坐标分别为 (x 1 x_1x 1 ,y 1 y_1y 1 ),(x 2 x_2x 2
 ,y 2 y_2y 
2
​ ) ,(x 3 x_3x 
3
​ ,y 3 y_3y 
3) 。
样例输入
10 6 4 12 12
0 2 13 2 13 15

输出样例
39.99
请计算，小蓝在荒岛上可以探测到的面积有多大？
————————————————
版权声明：本文为CSDN博主「一点微风起」的原创文章，遵循CC 4.0 BY-SA版权协议，转载请附上原文出处链接及本声明。
原文链接：https://blog.csdn.net/m0_48960163/article/details/115124027
 */
public class _09荒岛探测 {

}
