package _2018_A;

import java.util.Scanner;

/*
 * 如下的10行数据，每行有10个整数，请你求出它们的乘积的末尾有多少个零？
5650 4542 3554 473 946 4114 3871 9073 90 4329
2758 7949 6113 5659 5245 7432 3051 4434 6704 3594
9937 1173 6866 3397 4759 7557 3070 2287 1453 9899
1486 5722 3135 1170 4014 5510 5120 729 2880 9019
2049 698 4582 4346 4427 646 9742 7340 1230 7683
5693 7015 6887 7381 4172 4341 2909 2027 7355 5649
6701 6645 1671 5978 2704 9926 295 3125 3878 6785
2066 4247 4800 1578 6652 4616 1113 6205 3264 2915
3966 5291 2904 1285 2193 1428 2265 8730 9436 7074
689 5510 8243 6114 337 4096 8199 7313 3685 211
注意：需要提交的是一个整数，表示末尾零的个数。不要填写任何多余内容。
解：末尾的零只能由2*5产生，所以只要求出2和5的个数，取最小即可
————————————————
版权声明：本文为CSDN博主「郝大侠001」的原创文章，遵循CC 4.0 BY-SA版权协议，转载请附上原文出处链接及本声明。
原文链接：https://blog.csdn.net/jmkmlm123456/article/details/87639598
 */
public class _03乘积尾零 {
		public static void main(String[] args) {
	int sum1=0,sum2=0,sum;
	int n;
	Scanner scan = new Scanner(System.in);
	for(int i=0;i<100;i++) {
//		System.out.println("第"+i+1+"次输入");
		n = scan.nextInt();
		while(n%5==0) {
			sum1++;
			n=n/5;
		}
		while(n%2==0) {
			sum2++;
			n=n/2;
		}
		
	}
	
	if(sum1<sum2) {
		sum = sum1;
	}else {
		sum=sum2;
	}
	System.out.println(sum);
		}
}
